% calib 19号数据
% 手眼数据
eye = [ 55.29, 50.99, -739.39, 1;
    3.833, 94.76, -760.15, 1;
    28.00, 141.45, -775.25, 1;
    2.13, 164.33, -786.06, 1;
    -73.9, 181.11, -797.54, 1;
    -149.68, 180.09, -800.07, 1;
    -199.51, 201.46, -810.04, 1;
    -197.91, 133.15, - 784.79, 1;
    -196.73, 84.27, -764.14, 1;
    -121.53, 65.95, -755.68, 1];

hand = [620.79, -3.84 46.34, 1;
    564.93, 57.48, 43.21, 1;
    502.63, 31.65, 43.08, 1;
    474.43, 61.73, 41.53, 1;
    448.98, 152.99, 36.18, 1;
    454.66, 240.95, 30.84, 1;
    426.16, 303.27, 27.10, 1;
    516.39, 298.60, 28.26, 1;
    576.75, 296.611, 26.55, 1;
    601.57, 206.31, 33.23, 1];

% hand 所有点到第一个点的距离
for i = 1:size(hand,1)
    dh(i) = norm(hand(i,:)-hand(1,:));
end
% eye 所有点到第一个点的距离
for i = 1:size(eye,1)
    de(i) = norm(eye(i,:)-eye(1,:));
end
% 距离比值，也就是缩放比例
sCal = mean(dh(2:end)./de(2:end));
% eye 乘以缩放系数
eye(:,1:3) = eye(:,1:3)*sCal;

% 用最小二乘求解Te2h
lb = [-1,-1,-1,-2000];
ub = [1,1,1,2000];
options = optimoptions(@lsqlin,'Algorithm','interior-point','Display','iter');
r1 = lsqlin(eye,hand(:,1),[],[],[],[],lb,ub,[0.1 0.1 0.1 0.1]);
r2 = lsqlin(eye,hand(:,2),[],[],[],[],lb,ub,[0.1 0.1 0.1 0.1]);
r3 = lsqlin(eye,hand(:,3),[],[],[],[],lb,ub,[0.1 0.1 0.1 0.1]);

Te2h = [r1';r2';r3';0,0,0,1];
disp('calibration done')

% 误差分析
Htest = Te2h*eye';
Err = mean(mean(abs((Htest(1:3,:) - hand(:,1:3)')./hand(:,1:3)'*100)))
ErrM = Htest(1:3,:) - hand(:,1:3)';
% plot3(hand(:,1),hand(:,2),hand(:,3),'bx'); hold on
% plot3(Htest(1,:),Htest(2,:),Htest(3,:),'rx'); hold off
% plot3(eye(:,1),eye(:,2),eye(:,3),'bx');
% xlabel('x');ylabel('y');zlabel('z')